RT-Thread/rt-thread/bsp/ht32/libraries/HT32_STD_1xxxx_FWLib/library/HT32F1xxxx_Driver/src/ht32f1xxxx_pwrcu.c
/*********************************************************************************************************//**
 * @file    ht32f1xxxx_pwrcu.c
 * @version $Rev:: 2970         $
 * @date    $Date:: 2023-10-25 #$
 * @brief   This file provides all the Power Control Unit firmware functions.
 *************************************************************************************************************
 * @attention
 *
 * Firmware Disclaimer Information
 *
 * 1. The customer hereby acknowledges and agrees that the program technical documentation, including the
 *    code, which is supplied by Holtek Semiconductor Inc., (hereinafter referred to as "HOLTEK") is the
 *    proprietary and confidential intellectual property of HOLTEK, and is protected by copyright law and
 *    other intellectual property laws.
 *
 * 2. The customer hereby acknowledges and agrees that the program technical documentation, including the
 *    code, is confidential information belonging to HOLTEK, and must not be disclosed to any third parties
 *    other than HOLTEK and the customer.
 *
 * 3. The program technical documentation, including the code, is provided "as is" and for customer reference
 *    only. After delivery by HOLTEK, the customer shall use the program technical documentation, including
 *    the code, at their own risk. HOLTEK disclaims any expressed, implied or statutory warranties, including
 *    the warranties of merchantability, satisfactory quality and fitness for a particular purpose.
 *
 * <h2><center>Copyright (C) Holtek Semiconductor Inc. All rights reserved</center></h2>
 ************************************************************************************************************/

/* Includes ------------------------------------------------------------------------------------------------*/
#include "ht32f1xxxx_pwrcu.h"

/** @addtogroup HT32F1xxxx_Peripheral_Driver HT32F1xxxx Peripheral Driver
  * @{
  */

/** @defgroup PWRCU PWRCU
  * @brief PWRCU driver modules
  * @{
  */


/* Private constants ---------------------------------------------------------------------------------------*/
/** @defgroup PWRCU_Private_Define PWRCU private definitions
  * @{
  */
#define APBCCR1_ADDR      (HT_CKCU_BASE  + 0x30)
#define BAKCR_ADDR        (HT_PWRCU_BASE + 0x04)
#define LVDCSR_ADDR       (HT_PWRCU_BASE + 0x10)

#define BB_ADCEN          BitBand(APBCCR1_ADDR, 24)
#define BB_RTCEN          BitBand(APBCCR1_ADDR, 6)

#define BB_LDOLCM         BitBand(BAKCR_ADDR, 2)
#define BB_LDOOFF         BitBand(BAKCR_ADDR, 3)
#define BB_DMOSON         BitBand(BAKCR_ADDR, 7)
#define BB_WUPEN          BitBand(BAKCR_ADDR, 8)
#define BB_WUPIEN         BitBand(BAKCR_ADDR, 9)
#define BB_VRDYSC         BitBand(BAKCR_ADDR, 12)
#define BB_DMOSSTS        BitBand(BAKCR_ADDR, 15)

#define BB_BODEN          BitBand(LVDCSR_ADDR, 0)
#define BB_BODRIS         BitBand(LVDCSR_ADDR, 1)
#define BB_BODF           BitBand(LVDCSR_ADDR, 3)
#define BB_LVDEN          BitBand(LVDCSR_ADDR, 16)
#define BB_LVDF           BitBand(LVDCSR_ADDR, 19)
#define BB_LVDIWEN        BitBand(LVDCSR_ADDR, 20)
#define BB_LVDEWEN        BitBand(LVDCSR_ADDR, 21)

#define LDOFTRM_MASK      0xFFFFFFCF
#define LVDS_MASK         0xFFB9FFFF
#define BAKRST_SET        0x1
#define BAKTEST_READY     0x27
#define TIME_OUT          48000000

#define SLEEPDEEP_SET     0x04      /*!< Cortex SLEEPDEEP bit                                               */
/**
  * @}
  */

/* Global functions ----------------------------------------------------------------------------------------*/
/** @defgroup PWRCU_Exported_Functions PWRCU exported functions
  * @{
  */
/*********************************************************************************************************//**
 * @brief Deinitialize Backup domain which contains PWRCU and RTC units.
 * @retval None
 ************************************************************************************************************/
void PWRCU_DeInit(void)
{
  HT_PWRCU->CR = BAKRST_SET;
  while(HT_PWRCU->CR & 0xFFFFEFFF); /* Skip Bit 12 when wait RESET finish.                                  */
  while (HT_PWRCU->SR);             /* Waits until the BAKPORF be cleared by read                           */
}

/*********************************************************************************************************//**
 * @brief Waits, until the PWRCU can be accessed.
 * @retval PWRCU_TIMEOUT or PWRCU_OK
 ************************************************************************************************************/
PWRCU_Status PWRCU_CheckReadyAccessed(void)
{
  u32 wTimeOutCnt = TIME_OUT;

#if (!LIBCFG_NO_BACK_DOMAIN)
  /* Set the ISO control bit                                                                                */
  HT_CKCU->LPCR = 0x1;
#endif

  while (--wTimeOutCnt)
  {
    if (HT_PWRCU->TEST == BAKTEST_READY)
    {
      #if (!LIBCFG_NO_BACK_DOMAIN)
      u32 write = ~HT_PWRCU->BAKREG[9];
      u32 backup = HT_PWRCU->BAKREG[9];
      while (1)
      {
        HT_PWRCU->BAKREG[9] = write;
        if (HT_PWRCU->BAKREG[9] == write) break;
      }
      HT_PWRCU->BAKREG[9] = backup;
      #endif
      return PWRCU_OK;
    }
  }
  return PWRCU_TIMEOUT;
}

/*********************************************************************************************************//**
 * @brief Return the flags of PWRCU.
 * @retval This function will return one of the following:
 *   - 0x0000                                   : There is no flag is set.
 *   - 0x0001 (PWRCU_FLAG_PWRPOR)               : Backup domain power-on reset flag has been set.
 *   - 0x0002 (PWRCU_FLAG_PD)                   : Power-Down flag has been set.
 *   - 0x0100 (PWRCU_FLAG_WUP)                  : External WAKEUP pin flag has been set.
 *   - 0x0102 (PWRCU_FLAG_PD | PWRCU_FLAG_WUP)  : Both PDF and WUPF flags have been set.
 ************************************************************************************************************/
u16 PWRCU_GetFlagStatus(void)
{
  u32 uRTCStatus = 0;
  u32 uStatus;
  uRTCStatus = BB_RTCEN;

  BB_RTCEN = 1;

  uStatus =  HT_PWRCU->SR;
  BB_RTCEN = uRTCStatus;

  return uStatus;
}

#if (!LIBCFG_NO_BACK_DOMAIN)
/*********************************************************************************************************//**
 * @brief Return the value of specified backup register.
 * @param BAKREGx: Number of backup register. Where x can be 0 ~ 9.
 * @return Between 0x0 ~ 0xFFFFFFFF.
 ************************************************************************************************************/
u32 PWRCU_ReadBackupRegister(PWRCU_BAKREG_Enum BAKREGx)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_PWRCU_BAKREG(BAKREGx));

  return HT_PWRCU->BAKREG[BAKREGx];
}

