RT-Thread/rt-thread/bsp/ht32/libraries/HT32_STD_1xxxx_FWLib/library/HT32F1xxxx_Driver/src/ht32f1xxxx_pwrcu.c
  BB_RTCEN = uRTCStatus;

  /* Sets SLEEPDEEP bit of Cortex System Control Register                                                   */
  SCB->SCR |= SLEEPDEEP_SET;

  /* Enters power-down mode                                                                                 */
  __WFE();

  BB_ADCEN = uADCStatus;
}

#if (LIBCFG_PWRCU_LDO_LEGACY)
#else
/*********************************************************************************************************//**
 * @brief Configure LDO output voltage fine trim.
 * @param VolOffset: LDO default output voltage offset.
 *   This parameter can be one of following:
 *     @arg PWRCU_LDO_DEFAULT      : default output voltage
 *     @arg PWRCU_LDO_OFFSET_DEC5P : default output voltage offset -5%
 *     @arg PWRCU_LDO_OFFSET_ADD3P : default output voltage offset +3%
 *     @arg PWRCU_LDO_OFFSET_ADD7P : default output voltage offset +7%
 * @retval None
 ************************************************************************************************************/
void PWRCU_SetLDOFTRM(PWRCU_LDOFTRM_Enum VolOffset)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_PWRCU_LDOFTRM(VolOffset));

  do {
    HT_PWRCU->CR = (HT_PWRCU->CR & LDOFTRM_MASK) | VolOffset;
  } while ((HT_PWRCU->CR & ~LDOFTRM_MASK) != VolOffset);
}
#endif

/*********************************************************************************************************//**
 * @brief Configure LVD voltage level.
 * @param Level: Low voltage detect level.
 *   This parameter can be one of the following:
 *   HT32F165x:
 *     @arg PWRCU_LVDS_2V7 : 2.7 V
 *     @arg PWRCU_LVDS_2V8 : 2.9 V
 *     @arg PWRCU_LVDS_2V9 : 2.9 V
 *     @arg PWRCU_LVDS_3V  : 3.0 V
 *     @arg PWRCU_LVDS_3V1 : 3.1 V
 *     @arg PWRCU_LVDS_3V2 : 3.2 V
 *     @arg PWRCU_LVDS_3V4 : 3.4 V
 *     @arg PWRCU_LVDS_3V5 : 3.5 V
 *   HT32F123xx:
 *     @arg PWRCU_LVDS_2V25 : 2.25 V
 *     @arg PWRCU_LVDS_2V4  : 2.40 V
 *     @arg PWRCU_LVDS_2V55 : 2.55 V
 *     @arg PWRCU_LVDS_2V7  : 2.70 V
 *     @arg PWRCU_LVDS_2V85 : 2.85 V
 *     @arg PWRCU_LVDS_3V   : 3.00 V
 *     @arg PWRCU_LVDS_3V15 : 3.15 V
 *     @arg PWRCU_LVDS_3V3  : 3.30 V
 *   HT32F12364:
 *     @arg PWRCU_LVDS_1V75 : 1.75 V
 *     @arg PWRCU_LVDS_1V95 : 1.95 V
 *     @arg PWRCU_LVDS_2V15 : 2.15 V
 *     @arg PWRCU_LVDS_2V35 : 2.35 V
 *     @arg PWRCU_LVDS_2V55 : 2.55 V
 *     @arg PWRCU_LVDS_2V75 : 2.75 V
 *     @arg PWRCU_LVDS_2V95 : 2.95 V
 *     @arg PWRCU_LVDS_3V15 : 3.15 V
 * @retval None
 ************************************************************************************************************/
void PWRCU_SetLVDS(PWRCU_LVDS_Enum Level)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_PWRCU_LVDS(Level));

  HT_PWRCU->LVDCSR = (HT_PWRCU->LVDCSR & LVDS_MASK) | Level;
}

/*********************************************************************************************************//**
 * @brief Enable or Disable LVD function.
 * @param NewState: This parameter can be ENABLE or DISABLE.
 * @retval None
 ************************************************************************************************************/
void PWRCU_LVDCmd(ControlStatus NewState)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_CONTROL_STATUS(NewState));

  BB_LVDEN = NewState;
}

/*********************************************************************************************************//**
 * @brief Enable or Disable BOD reset function.
 * @param NewState: This parameter can be ENABLE or DISABLE.
 * @retval None
 ************************************************************************************************************/
void PWRCU_BODCmd(ControlStatus NewState)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_CONTROL_STATUS(NewState));

  BB_BODEN = NewState;
}

/*********************************************************************************************************//**
 * @brief Select when the BOD occurs, the action for the cause Reset or Interrupt.
 * @param Selection: BOD reset or interrupt selection.
 *   This parameter can be one of the following values:
 *     @arg PWRCU_BODRIS_RESET : Reset the whole chip
 *     @arg PWRCU_BODRIS_INT   : Assert interrupt
 * @retval None
 ************************************************************************************************************/
void PWRCU_BODRISConfig(PWRCU_BODRIS_Enum Selection)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_PWRCU_BODRIS(Selection));

  BB_BODRIS = Selection;
}

/*********************************************************************************************************//**
 * @brief Return the flag status of LVD.
 * @retval SET or RESET
 ************************************************************************************************************/
FlagStatus PWRCU_GetLVDFlagStatus(void)
{
  return (FlagStatus)BB_LVDF;
}

/*********************************************************************************************************//**
 * @brief Return the flag status of BOD.
 * @retval SET or RESET
 ************************************************************************************************************/
FlagStatus PWRCU_GetBODFlagStatus(void)
{
  return (FlagStatus)BB_BODF;
}

/*********************************************************************************************************//**
 * @brief Return the DMOS status.
 * @retval This function will return one of the following values:
 *    - PWRCU_DMOS_STS_ON              : DMOS on
 *    - PWRCU_DMOS_STS_OFF             : DMOS off
 *    - PWRCU_DMOS_STS_OFF_BY_BODRESET : DMOS off caused by brow out reset
 ************************************************************************************************************/
PWRCU_DMOSStatus PWRCU_GetDMOSStatus(void)
{
  u32 wDmosStatus = HT_PWRCU->CR & 0x8080;

  if (wDmosStatus == 0x0)
  {
    return PWRCU_DMOS_STS_OFF;
  }
  else if (wDmosStatus == 0x8080)
  {
    return PWRCU_DMOS_STS_ON;
  }
  else
  {
    return PWRCU_DMOS_STS_OFF_BY_BODRESET;
  }
}

